// let numbers_array = [53,48,77,53,22,6,45,75,1520,1115,456,51,895,2358,12,4]; 
 
 
// 1) Հաշվել  միջին թվաբանականը  
// 2) տպել զանգվածի ամենափոքր  թիվը 
// 3) տպել զանգվածի ամենամեծ  թիվը 
// 4) տպել զանգվածի ամենափոքր զույգ  թիվը 
// 5) տպել զանգվածի այն թվերը որոնք առանց մնացորդի բաժանվում են 3 -ի  
// 6) գրել for ցիկլ որը կտպի 50-ից մինչև 100ը այն թվերը որոնք առանց մնացորդի բաժանվում են 8 -ի




// 1) Հաշվել  միջին թվաբանականը  
// ____________________________________________________________

// let numbers_array = [53,48,77,53,22,6,45,75,1520,1115,456,51,895,2358,12,4]; 
// let num = 0


// numbers_array.forEach((a) =>{
//     num = num + a
// })

// console.log(Math.floor(num / numbers_array.length));


// ____________________________________________________________







// 2) տպել զանգվածի ամենափոքր  թիվը 

// ____________________________________________________________

// let numbers_array = [53,48,77,53,22,6,45,75,1520,1115,456,51,895,2358,12,4]; 

// console.log(Math.min(...numbers_array));



// ____________________________________________________________





// 3) տպել զանգվածի ամենամեծ  թիվը 

// ____________________________________________________________

// let numbers_array = [53,48,77,53,22,6,45,75,1520,1115,456,51,895,2358,12,4]; 

// console.log(Math.max(...numbers_array));




// ____________________________________________________________





// 4) տպել զանգվածի ամենափոքր զույգ  թիվը 

// ____________________________________________________________

// let numbers_array = [53,48,77,53,22,6,45,75,1520,1115,456,51,895,2358,12,4]; 
// let newArr = []

// numbers_array.forEach((a) =>{
//     if (a % 2 == 0) {
//         newArr.push(a)
//     }
// })


// console.log(Math.min(...newArr));



// ____________________________________________________________




// 5) տպել զանգվածի այն թվերը որոնք առանց մնացորդի բաժանվում են 3 -ի  

// ____________________________________________________________

// let numbers_array = [53,48,77,53,22,6,45,75,1520,1115,456,51,895,2358,12,4]; 
// let newArr = []

// numbers_array.forEach((a) =>{
//     if (a % 3 == 0) {
//         newArr.push(a)
//     }
// })


// console.log(...newArr);




// ____________________________________________________________





// 6) գրել for ցիկլ որը կտպի 50-ից մինչև 100ը այն թվերը որոնք առանց մնացորդի բաժանվում են 8 -ի

// ____________________________________________________________


// for (let i = 50; i < 101; i++) {
//     if (i % 8 == 0) {
//         console.log(i);
//     }
    
// }



// ____________________________________________________________


alert("open zip")








